'''
Задайте натуральное число N. Напишите программу, которая составит список
 простых множителей числа N.
'''
def Factorisation(n):
    Ans = []
    d = 2
    while d * d <= n:
        if n % d == 0:
            Ans.append(d)
            n //= d
        else:
            d += 1
    if n > 1:
        Ans.append(n)
    return Ans
'''2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97,'''
print(Factorisation(2*2*2*2*2*3*3*3*3*5*5*7*11*13*17*19*23*29*31*37*41*43*47*53*59*61*67*71))